sales-api/sampleRequest/TinRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header />
   <soapenv:Body>
      <p45:classifyInvolvedParty xmlns:p45="http://LB_GBO_Sales/IA_CommonReportingStandards">
         <request>
            <header>
               <interactionId>1ky7a14tx74681ihenrughtrt2</interactionId>
               <channelId>IBL</channelId>
               <businessTransaction>CharacterEvaluationService</businessTransaction>
               <LloydsHeaders>
                  <nameSpace>http://www.lloydstsb.com/Schema/Infrastructure/SOAP</nameSpace>
                  <name>ServiceRequest</name>
                  <prefix>ns4</prefix>
                  <value xmlns:p964="http://www.lloydstsb.com/Schema/Infrastructure/SOAP" xsi:type="p964:ServiceRequest" p964:mustReturn="0">
                     <p964:ServiceName>CharacterEvaluationService</p964:ServiceName>
                     <p964:Action>classifyInvolvedParty</p964:Action>
                     <p964:From>10.245.211.214</p964:From>
                     <p964:MessageId>1ky7a14tx74681ihenrughtrt2</p964:MessageId>
                  </value>
               </LloydsHeaders>
               <LloydsHeaders>
                  <nameSpace>http://www.lloydstsb.com/Schema/Enterprise/LCSM</nameSpace>
                  <name>bapiInformation</name>
                  <prefix>ns5</prefix>
                  <value xmlns:p308="http://www.lloydstsb.com/Schema/Enterprise/LCSM" xsi:type="p308:bapiInformation">
                     <p308:BAPIId>B001</p308:BAPIId>
                     <p308:BAPIOperationalVariables>
                        <p308:bForceHostCall>0</p308:bForceHostCall>
                        <p308:bPopulateCache>0</p308:bPopulateCache>
                        <p308:bBatchRetry>0</p308:bBatchRetry>
                     </p308:BAPIOperationalVariables>
                     <p308:BAPIHeader>
                        <p308:useridAuthor>UNAUTHSALE</p308:useridAuthor>
                        <p308:stpartyObo>
                           <p308:host>I</p308:host>
                           <p308:partyid>AAGATEWAY</p308:partyid>
                           <p308:ocisid>0</p308:ocisid>
                        </p308:stpartyObo>
                        <p308:chanid>IBL</p308:chanid>
                        <p308:chansecmode>PWD</p308:chansecmode>
                        <p308:sessionid>1ky7a14tx74681ihenrughtrt2</p308:sessionid>
                        <p308:userAgent>Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/59.0.3071.115 Safari/537.36</p308:userAgent>
                        <p308:inboxidClient>GX</p308:inboxidClient>
                        <p308:chanctxt>1</p308:chanctxt>
                        <p308:encVerNo xsi:nil="true" />
                     </p308:BAPIHeader>
                  </value>
               </LloydsHeaders>
               <LloydsHeaders>
                  <nameSpace>http://www.lloydstsb.com/Schema/Infrastructure/SOAP</nameSpace>
                  <name>ContactPoint</name>
                  <prefix>ns4</prefix>
                  <value xmlns:p964="http://www.lloydstsb.com/Schema/Infrastructure/SOAP" xsi:type="p964:ContactPoint" p964:mustReturn="0">
                     <p964:ContactPointType>003</p964:ContactPointType>
                     <p964:ContactPointId>0000777505</p964:ContactPointId>
                     <p964:ApplicationId>AL07618</p964:ApplicationId>
                     <p964:InitialOriginatorType>Browser</p964:InitialOriginatorType>
                     <p964:InitialOriginatorId>10.245.224.125</p964:InitialOriginatorId>
                     <p964:OperatorType>Customer</p964:OperatorType>
                  </value>
               </LloydsHeaders>
               <LloydsHeaders>
                  <nameSpace>http://LB_GBO_Sales/Messages</nameSpace>
                  <name>Security</name>
                  <prefix>lgsm</prefix>
                  <value xmlns:p55="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xsi:type="p55:SecurityHeaderType" mustReturn="0">
                     <p55:UsernameToken p55:UNPMechanismType="NTLM" p55:UserType="013" Id="LloydsTSBSecurityToken">
                        <p55:Username>UNAUTHSALE</p55:Username>
                     </p55:UsernameToken>
                  </value>
               </LloydsHeaders>
            </header>
            <requestHeader>
               <dataSourceName>19</dataSourceName>
            </requestHeader>
            <classificationCondition>
               <inputParameters>ONLINEINDICIACHECK</inputParameters>
               <subRules>
                  <businessDescription>
                     <onlineIndiCiaCheck>
                        <CountryOfBirth>DMA</CountryOfBirth>
                        <CountryOfNationality>DMA</CountryOfNationality>
                        <CountryOfTaxResidency>DMA</CountryOfTaxResidency>
                        <CountryForAnyCurrentAddress>GBR</CountryForAnyCurrentAddress>
                     </onlineIndiCiaCheck>
                  </businessDescription>
                  <name>AdditionalClassificationData</name>
               </subRules>
            </classificationCondition>
            <involvedParty>
               <objectReference>
                  <alternateId>
                     <externalSystemIdentifier>19</externalSystemIdentifier>
                  </alternateId>
               </objectReference>
            </involvedParty>
            <scheme>
               <description>FATCA</description>
               <name>1</name>
            </scheme>
            <scheme>
               <description>CRS</description>
               <name>4</name>
            </scheme>
         </request>
      </p45:classifyInvolvedParty>
   </soapenv:Body>
</soapenv:Envelope>
